/* 班级 学号 姓名 */
#include <iostream>
using namespace std;
/* -----------------------------------------

     本文件功能：
	1、放被 hanoi_main.cpp/hanoi_menu.cpp 中的各函数调用的菜单各项对应的执行函数

     本文件要求：
	1、不允许定义外部全局变量（const及#define不在限制范围内）
	2、不允许定义静态全局变量（全局变量的使用准则是：少用、慎用、能不用尽量不用）
	3、静态局部变量的数量不限制，但使用准则也是：少用、慎用、能不用尽量不用
	4、按需加入系统头文件、自定义头文件、命名空间等

   ----------------------------------------- */

/***************************************************************************
	函数名称：menu
	功    能：输出菜单项并调用各项对应的执行函数
	输入参数：无
	说    明：
***************************************************************************/
int menu()
{
	cout << "---------------------------------\n"
		<< "1.基本解\n"
		<< "2.基本解(步数记录)\n"
		<< "3.内部数组显示(横向)\n"
		<< "4.内部数组显示(纵向 + 横向)\n"
		<< "5.图形解 - 预备 - 画三个圆柱\n"
		<< "6.图形解 - 预备 - 在起始柱上画n个盘子\n"
		<< "7.图形解 - 预备 - 第一次移动\n"
		<< "8.图形解 - 自动移动版本\n"
		<< "9.图形解 - 游戏版\n"
		<< "0.退出\n"
		<< "---------------------------------\n"
		<< "[请选择:]";
	int choose; cin >> choose;
	return choose;
}

/***************************************************************************
	函数名称：paraIn
	功    能：输入汉诺塔的多个参数
	输入参数：n: 汉诺塔总层数的引用
			src: 起始柱编号的引用
			tmp: 中间柱编号的引用
			dst: 终点柱编号的引用
			pause: 延时
	返 回 值：无
	说    明：通过引用传回多个参数的值
***************************************************************************/
void para_in(int& n, char& src, char& tmp, char& dst, int pause, int choose)
{
	while (1) {
		cout << "请输入汉诺塔的层数(1-16)" << endl;
		n = getchar();
		n -= '0';
		char ch;
		while ((ch = getchar()) != '\n');
		if (n >= 1 && n <= 16)
			break;
	}

	while (1) {
		cout << "请输入起始柱(A-C)" << endl;
		src = getchar();
		char ch;
		while ((ch = getchar()) != '\n');
		if (src >= 'A' && src <= 'C')
			break;
	}
	
	while (1) {
		cout << "请输入目标柱(A-C)" << endl;
		dst = getchar();
		char ch;
		while ((ch = getchar()) != '\n');
		if (dst == src)
			cout << "目标柱(" << dst << ")不能与起始柱(" << src << ")相同" << endl;
		else {
			if (dst >= 'A' && dst <= 'C')
				break;
		}
	}
	
	if (src == 'A' && dst == 'B' || src == 'B' && dst == 'A')
		tmp = 'C';
	else if (src == 'A' && dst == 'C' || src == 'C' && dst == 'A')
		tmp = 'B';
	else if (src == 'B' && dst == 'C' || src == 'C' && dst == 'B')
		tmp = 'A';

	if (choose == 4 || choose == 8 || choose == 9) {
		while (1) {
			cout << "请输入移动速度(0-5：0-按回车单步演示 1-延时最长 5-延时最短)：" << endl;
			pause = getchar() - '0';
			char ch;
			while ((ch = getchar()) != '\n');
			if (pause >= 0 && pause <= 5)
				break;
		}
	}
}

